lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
/**
 ******************************************************************************
 * @file    edge_comm.c
 * @author  STM32H7 Optimization Expert
 * @brief   EdgeComm WiFi 模组驱动程序 (STM32H7 专用优化版)
 * @note    核心特性：
 * 1. AXI SRAM + D-Cache 一致性维护 (DMA 必备)
 * 2. 2Mbps 高波特率下的软件容错机制 (抗 ORE/FE 错误)
 * 3. 智能流式接收解析 (滑动窗口)
 * 4. 自动故障恢复与重连逻辑
 ******************************************************************************
 */

#include "edge_comm.h"
#include "SPI_AD7606.h"
#include "ad_acq_buffers.h"
#include "edgewind_ai.h"
#include "edgewind_ai_preprocess_params.h"
#include "edgewind_units.h"
#include "ESP32SPI/esp32_spi_debug.h"
#include "usart.h"
#include "arm_math.h"
#include "cmsis_os.h"
#include "FreeRTOS.h"
#include "task.h"
#include "fatfs.h"
#include "diskio.h"
#include "bsp_driver_sd.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdarg.h>
#include <math.h>

#ifndef EW_USE_ESP32_SPI_UI
#define EW_USE_ESP32_SPI_UI 1
#endif

#ifndef ESP32_SPI_STRESS_TEST
#define ESP32_SPI_STRESS_TEST 0
#endif

#ifndef ESP32_SPI_STRESS_FULL_UPLOAD
#define ESP32_SPI_STRESS_FULL_UPLOAD 0
#endif

#ifndef ESP32_SPI_STRESS_SENDLIMIT_MS
#define ESP32_SPI_STRESS_SENDLIMIT_MS 500U
#endif
#ifndef ESP32_SPI_FULL_IDLE_HEARTBEAT_MS
#define ESP32_SPI_FULL_IDLE_HEARTBEAT_MS 5000U
#endif

#ifndef ESP32_SPI_STRESS_DATA_UPDATE_MS
#define ESP32_SPI_STRESS_DATA_UPDATE_MS 1000U
#endif

#ifndef ESP32_SPI_STRESS_SPI_LABEL
#define ESP32_SPI_STRESS_SPI_LABEL "10MHz"
#endif

#ifndef ESP32_SPI_RESULT_OK
#define ESP32_SPI_RESULT_OK 0
#endif

#ifdef EDGEWIND_AI_RAWLITE_SIZE
#define ESP_AI_HAS_RAWLITE 1
#else
#define ESP_AI_HAS_RAWLITE 0
#endif

#ifndef ESP32_SPI_NACK_BUSY
#define ESP32_SPI_NACK_BUSY 5U
#endif
#ifndef ESP32_SPI_NACK_UNSUPPORTED_VERSION
#define ESP32_SPI_NACK_UNSUPPORTED_VERSION 3U
#endif
#ifndef ESP32_SPI_NACK_INVALID_STATE
#define ESP32_SPI_NACK_INVALID_STATE 7U
#endif
#ifndef ESP32_SPI_NACK_INVALID_PAYLOAD
#define ESP32_SPI_NACK_INVALID_PAYLOAD 8U
#endif

#ifndef ESP32_SPI_INVALID_STATE_AUTOSTOP_COUNT
#define ESP32_SPI_INVALID_STATE_AUTOSTOP_COUNT 3U
#endif

#ifndef ESP32_SPI_FULL_CONTINUOUS_DEFAULT
#define ESP32_SPI_FULL_CONTINUOUS_DEFAULT 0
#endif

#ifndef ESP_FORCE_FULL_REPORT_MODE
#define ESP_FORCE_FULL_REPORT_MODE 1
#endif

#ifndef ESP32_SPI_FULL_NOT_ARMED_LOG_MS
#define ESP32_SPI_FULL_NOT_ARMED_LOG_MS 5000U
#endif
#ifndef ESP32_SPI_FULL_RESULT_TIMEOUT_MS
#define ESP32_SPI_FULL_RESULT_TIMEOUT_MS 8000U
#endif
#ifndef ESP32_SPI_FULL_TX_STALE_MS
#define ESP32_SPI_FULL_TX_STALE_MS 8000U
#endif
#ifndef ESP32_SPI_FULL_WAIT_LOG_MS
#define ESP32_SPI_FULL_WAIT_LOG_MS 2000U
#endif
#ifndef ESP32_SPI_FULL_RESULT_POLL_MS
#define ESP32_SPI_FULL_RESULT_POLL_MS 20U
#endif
#ifndef ESP32_SPI_FULL_TIMEOUT_HOLDOFF_MS
#define ESP32_SPI_FULL_TIMEOUT_HOLDOFF_MS 1000U
#endif
#ifndef ESP32_SPI_FULL_HTTP_FAIL_HOLDOFF_MS
#define ESP32_SPI_FULL_HTTP_FAIL_HOLDOFF_MS 500U
#endif
#ifndef ESP32_SPI_FULL_BUSY_HOLDOFF_MS
#define ESP32_SPI_FULL_BUSY_HOLDOFF_MS 3000U
#endif
#ifndef ESP32_SPI_FULL_MAX_HOLDOFF_MS
#define ESP32_SPI_FULL_MAX_HOLDOFF_MS 5000U
#endif
#ifndef ESP_ALGO_MIN_INTERVAL_MS
#define ESP_ALGO_MIN_INTERVAL_MS 250U
#endif
#ifndef EDGEWIND_AI_RUN_INTERVAL_MS
#define EDGEWIND_AI_RUN_INTERVAL_MS 1000U
#endif
#ifndef EDGEWIND_AI_STATS_LOG_MS
#define EDGEWIND_AI_STATS_LOG_MS 5000U
#endif
#ifndef EDGEWIND_AI_GOLDEN_SELFTEST
#define EDGEWIND_AI_GOLDEN_SELFTEST 0
#endif
#ifndef EDGEWIND_AI_GOLDEN_MAX_VECTORS
#define EDGEWIND_AI_GOLDEN_MAX_VECTORS 64U
#endif
#ifndef EDGEWIND_AI_GOLDEN_DIR
#define EDGEWIND_AI_GOLDEN_DIR "0:/ai_golden"
#endif
#ifndef EDGEWIND_DSP_SNAPSHOT_LOG_MS
#define EDGEWIND_DSP_SNAPSHOT_LOG_MS 5000U
#endif
#ifndef ESP32_SPI_FULL_PACKETS_PER_POLL
#define ESP32_SPI_FULL_PACKETS_PER_POLL 8U
#endif
#ifndef ESP32_SPI_FULL_YIELD_EVERY
#define ESP32_SPI_FULL_YIELD_EVERY 2U
#endif
#ifndef ESP32_SPI_FULL_PACKET_ACCEPT_TIMEOUT_MS
#define ESP32_SPI_FULL_PACKET_ACCEPT_TIMEOUT_MS 200U
#endif
#ifndef ESP32_SPI_FULL_PROGRESS_LOG_MS
#define ESP32_SPI_FULL_PROGRESS_LOG_MS 5000U
#endif
#ifndef ESP32_SPI_FULL_END_ACCEPT_TIMEOUT_MS
#define ESP32_SPI_FULL_END_ACCEPT_TIMEOUT_MS 500U
#endif
#ifndef ESP_SERVER_CMD_DEDUPE_WINDOW_MS
#define ESP_SERVER_CMD_DEDUPE_WINDOW_MS 120000U
#endif
#ifndef ESP32_SPI_AUTO_RECOVER_POLL_MS
#define ESP32_SPI_AUTO_RECOVER_POLL_MS 1500U
#endif
#ifndef ESP32_SPI_AUTO_RECOVER_RETRY_MS
#define ESP32_SPI_AUTO_RECOVER_RETRY_MS 3000U
#endif
#ifndef ESP32_SPI_AUTO_RECOVER_FAIL_BACKOFF_MS
#define ESP32_SPI_AUTO_RECOVER_FAIL_BACKOFF_MS 5000U
#endif
#ifndef ESP32_SPI_WIFI_CONNECT_SETTLE_MS
#define ESP32_SPI_WIFI_CONNECT_SETTLE_MS 30000U
#endif
#ifndef ESP32_SPI_WIFI_STATUS_POLL_MS
#define ESP32_SPI_WIFI_STATUS_POLL_MS 500U
#endif
#ifndef ESP_UPLOAD_SNAPSHOT_SLOT_COUNT
#define ESP_UPLOAD_SNAPSHOT_SLOT_COUNT 2U
#endif
#ifndef EW_FULL_PIPELINE_EXPERIMENT
#define EW_FULL_PIPELINE_EXPERIMENT 0
#endif

/* 引用 usart.c 中定义的句柄 */
#define ESP_PRINT_WAVEFORM_POINTS 0
#define ADS_BADFRAME_MONITOR 1
#ifndef ADS_BADFRAME_MONITOR
#define ADS_BADFRAME_MONITOR 0
#endif
/* =================================================================================
 * 浮点数输出安全：
 * - C 库 printf/sprintf 对 NaN/Inf 往往会输出 "nan"/"inf"（小写），这会导致 Python json.loads 直接解析失败，
 *   进而出现“服务器端全 0 / 节点超时注销 / 过几秒又恢复”等现象。
 * - 所以：所有写入 JSON 的 float 必须先做有限值钳位。
 * ================================================================================= */
static inline float ESP_SafeFloat(float v)
{
    /* NaN: v!=v；Inf: 与阈值比较会成立 */
    if (!(v == v))
        return 0.0f;
    if (v > 1.0e20f || v < -1.0e20f)
        return 0.0f;
    return v;
}

/* ========= 上报数值格式（无浮点） =========
 * 用户要求：采集数据 *200 后按整数上传，JSON 里不再出现浮点数。
 * 说明：内部仍用 float 参与 FFT/计算，仅在“序列化到 JSON”阶段做定点缩放。 */
/* Current scale is 10x engineering units; see edgewind_units.h. */
#ifndef ESP_UPLOAD_SCALE
#define ESP_UPLOAD_SCALE EW_UPLOAD_ENGINEERING_VALUE_SCALE
#endif

/* 串口打印开关（默认关闭，避免影响 UI/上报性能）
 * 需求：打印“瞬时值(每点)”：printf("%f,%f,%f,%f", ch1,ch2,ch3,ch4)
 * 注意：若 STEP=1 且采样点很多，会显著占用 CPU/串口带宽，调试用即可。 */
#ifndef ESP_PRINT_WAVEFORM_POINTS
#define ESP_PRINT_WAVEFORM_POINTS 0
#endif

/* 打印步进：1=每点都打印；2=每 2 点打印一次... */
#ifndef ESP_PRINT_POINT_STEP
#define ESP_PRINT_POINT_STEP 1
#endif

static inline int32_t ESP_FloatToI32Scaled(float v)
{
    float x = ESP_SafeFloat(v) * (float)ESP_UPLOAD_SCALE;
    /* 四舍五入到整数 */
    return (int32_t)((x >= 0.0f) ? (x + 0.5f) : (x - 0.5f));
}

/* 安全追加格式化字符串到缓冲区（防止 http_packet_buf 越界导致“偶发坏帧/服务器解析失败/节点重连”） */
static inline int ESP_Appendf(char **pp, const char *end, const char *fmt, ...)
{
    if (!pp || !*pp || !end || *pp >= end)
        return 0;
    va_list ap;
    va_start(ap, fmt);
    int rem = (int)(end - *pp);
    int n = vsnprintf(*pp, (size_t)rem, fmt, ap);
    va_end(ap);
    if (n < 0)
        return 0;
    if (n >= rem)
    {
        /* 截断：把指针推进到末尾，返回失败 */
        *pp = (char *)end;
        return 0;
    }
    *pp += n;
    return 1;
}

/* Debug console uses USART1 only; ESP32 transport is SPI. */
static void ESP_Log(const char *format, ...);
static UART_HandleTypeDef *ESP_GetLogUart(void);
static void ESP_SetFaultCode(const char *code);
static void ESP_Console_HandleLine(char *line);
static void ESP_AI_GoldenSelfTest(void);
static void StrTrimInPlace(char *s);
void ESP_UI_Internal_OnLog(const char *line);
static void ESP_SetServerReportMode(uint8_t full);
static void ESP_SPI_ResetLocalReportState(const char *reason);
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
static void ESP_SPI_FullClearWaitState(void);
static uint8_t ESP_SPI_FullClearStaleWaitState(const char *context);
static uint8_t ESP_SPI_FullClearBlockedTxState(const char *context, uint8_t link_not_ready);
static void ESP_SPI_FullResetUploadRuntimeState(void);
static void ESP_SPI_FullEnterHoldoff(const char *reason, uint32_t holdoff_ms);
static bool ESP_SPI_FullHoldoffActive(uint32_t now_tick);
#endif
static void ESP_SetServerDownsampleStep(uint32_t step);
static bool ESP_TryParseDownsampleStep(const char *s, uint32_t *out_step);
static void ESP_SetServerUploadPoints(uint32_t points);
static bool ESP_TryParseUploadPoints(const char *s, uint32_t *out_points);
static bool ESP_CommParams_SaveToSD(void);
static void ESP_SPI_ApplyCommParamsToCoprocessor(const ESP_CommParams_t *p);
static bool ESP_UploadMode_LoadFromSD(void);
static bool ESP_UploadMode_SaveToSD(uint8_t full);
static void ESP_SPI_FullArmFrames(uint16_t frames);
static void ESP_SPI_FullSetContinuous(uint8_t enable);
static void ESP_SPI_FullPrintStatus(void);
static void ESP_UI_SPI_LogStatus(const char *prefix);
static bool ESP_UI_DoApplyConfig(void);
static bool ESP_UI_DoWiFi(void);
static bool ESP_UI_DoTCP(void);
static bool ESP_UI_DoRegister(void);
static bool ESP_UI_EnsureReportStartedEx(uint8_t mode, const char *reason_tag, uint8_t force_start);
static bool ESP_UI_EnsureReportStarted(uint8_t mode, const char *reason_tag);
static void ESP_UI_ScheduleAutoRecover(const char *reason, uint8_t want_report);
static void ESP_UI_PollAutoRecover(void);
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
static uint8_t ESP_SPI_FullControlBusy(void);
static void ESP_SPI_QueueCommParamsSync(const ESP_CommParams_t *p);
static void ESP_SPI_QueueReportModeSync(uint8_t full);
static void ESP_SPI_ServiceDeferredSync(void);
#endif


// 当前上报的故障码（默认正常 E00），可通过串口控制台动态修改
static char g_fault_code[4] = "E00";

