lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
static uint8_t g_ai_reported_class = 0U;
static uint8_t g_ai_fault_code_initialized = 0U;

static uint8_t ESP_AI_SelectReportedClass(const EdgeWind_AI_Result_t *result)
{
    if (result == NULL)
    {
        return g_ai_reported_class;
    }

    if ((result->class_id >= EDGEWIND_AI_CLASS_COUNT) ||
        (result->confidence < EDGEWIND_AI_CONFIDENCE_MIN))
    {
        g_ai_reported_class = 0U;
        return g_ai_reported_class;
    }

    g_ai_reported_class = result->class_id;
    return g_ai_reported_class;
}

static int ESP_AI_ProbPermille(float p)
{
    if ((p != p) || (p < 0.0f))
    {
        return 0;
    }
    if (p > 1.0f)
    {
        p = 1.0f;
    }
    return (int)((p * 1000.0f) + 0.5f);
}

static const float s_ai_default_aux4[EDGEWIND_AI_AUX_SIZE] =
{
    72.5f, 66.5f, 53.0f, 59.0f
};

static void ESP_AI_UpdateFaultCode(const float analog_v[4][AD_ACQ_POINTS],
                                   const float aux4[EDGEWIND_AI_AUX_SIZE],
                                   uint8_t aux4_valid_mask)
{
    static uint32_t last_ai_log_tick = 0U;
    static uint32_t last_ai_run_tick = 0U;
    EdgeWind_AI_Result_t result;
    int ret;
    uint8_t reported_class;
    const char *reported_code;
    uint32_t now_tick = HAL_GetTick();

    if (g_ai_fault_code_initialized != 0U &&
        EDGEWIND_AI_RUN_INTERVAL_MS > 0U &&
        (uint32_t)(now_tick - last_ai_run_tick) < EDGEWIND_AI_RUN_INTERVAL_MS)
    {
        return;
    }
    last_ai_run_tick = now_tick;

    ret = EdgeWind_AI_RunOnAnalogWindow(analog_v, aux4, aux4_valid_mask, &result);
    if (ret != 0)
    {
        if ((g_ai_fault_code_initialized == 0U) || (strncmp(g_fault_code, "E00", 3U) != 0))
        {
            strncpy(g_fault_code, "E00", sizeof(g_fault_code) - 1U);
            g_fault_code[sizeof(g_fault_code) - 1U] = '\0';
            g_ai_reported_class = 0U;
            g_ai_fault_code_initialized = 1U;
            ESP_Log("[AI] runtime error ret=%d; fallback report=E00\r\n", ret);
        }
        if ((uint32_t)(now_tick - last_ai_log_tick) >= EDGEWIND_AI_STATS_LOG_MS)
        {
            last_ai_log_tick = now_tick;
            ESP_Log("[AI] runtime error ret=%d; report=%s aux_valid=0x%02X\r\n",
                    ret,
                    g_fault_code,
                    (unsigned int)aux4_valid_mask);
        }
        return;
    }

    reported_class = ESP_AI_SelectReportedClass(&result);
    reported_code = EdgeWind_AI_ClassCode(reported_class);
    if ((g_ai_fault_code_initialized == 0U) || (strncmp(g_fault_code, reported_code, 3U) != 0))
    {
        strncpy(g_fault_code, reported_code, sizeof(g_fault_code) - 1U);
        g_fault_code[sizeof(g_fault_code) - 1U] = '\0';
        ESP_Log("[AI] fault_code updated: %s\r\n", g_fault_code);
        g_ai_fault_code_initialized = 1U;
    }

    if ((uint32_t)(now_tick - last_ai_log_tick) >= EDGEWIND_AI_STATS_LOG_MS)
    {
        last_ai_log_tick = now_tick;
        ESP_Log("[AI] pred=%s/%s conf=%d.%03d report=%s model=%s aux4=[%.1f,%.1f,%.1f,%.1f] valid=0x%02X ppermil=[%d,%d,%d,%d,%d,%d,%d] feat=%lums infer=%lums total=%lums\r\n",
                result.fault_code,
                EdgeWind_AI_ClassName(result.class_id),
                (int)result.confidence,
                (int)((result.confidence - (float)((int)result.confidence)) * 1000.0f),
                reported_code,
                EdgeWind_AI_ModelVersion(),
                (double)result.aux4[0],
                (double)result.aux4[1],
                (double)result.aux4[2],
                (double)result.aux4[3],
                (unsigned int)result.aux4_valid_mask,
                ESP_AI_ProbPermille(result.probabilities[0]),
                ESP_AI_ProbPermille(result.probabilities[1]),
                ESP_AI_ProbPermille(result.probabilities[2]),
                ESP_AI_ProbPermille(result.probabilities[3]),
                ESP_AI_ProbPermille(result.probabilities[4]),
                ESP_AI_ProbPermille(result.probabilities[5]),
                ESP_AI_ProbPermille(result.probabilities[6]),
                (unsigned long)result.feature_ms,
                (unsigned long)result.inference_ms,
                (unsigned long)result.total_ms);
    }
}

static bool ESP_AcquisitionWindowAllZero(float (*src)[WAVEFORM_POINTS])
{
    if (src == NULL)
    {
        return false;
    }

    for (uint8_t ch = 0U; ch < 4U; ch++)
    {
        for (int i = 0; i < WAVEFORM_POINTS; i++)
        {
            if (src[ch][i] != 0.0f)
            {
                return false;
            }
        }
    }
    return true;
}

#ifndef AXI_SRAM_SECTION
#define AXI_SRAM_SECTION __attribute__((section(".axi_sram")))
#endif

typedef struct
{
    float dwt[EDGEWIND_AI_DWT_SIZE];
    float feat[EDGEWIND_AI_FEAT_SIZE];
#if ESP_AI_HAS_RAWLITE
    float rawlite[EDGEWIND_AI_RAWLITE_SIZE];
#endif
    float spec[EDGEWIND_AI_SPEC_SIZE];
    float aux[EDGEWIND_AI_AUX_SIZE];
    float expected[EDGEWIND_AI_CLASS_COUNT];
} ESP_AI_GoldenBuffers_t;

static ESP_AI_GoldenBuffers_t g_ai_golden_expected AXI_SRAM_SECTION;
static ESP_AI_GoldenBuffers_t g_ai_golden_generated AXI_SRAM_SECTION;

Channel_Data_t node_channels[4] AXI_SRAM_SECTION;
volatile uint8_t g_esp_ready = 0U;
static volatile uint8_t g_report_enabled = 0U;
static volatile uint8_t g_ui_wifi_ok = 0U;
static volatile uint8_t g_ui_tcp_ok = 0U;
static volatile uint8_t g_ui_reg_ok = 0U;
static volatile uint8_t g_ui_auto_recover_pending = 0U;
static volatile uint8_t g_ui_auto_recover_want_report = 0U;
static uint32_t g_ui_auto_recover_next_poll_tick = 0U;
static uint32_t g_ui_auto_recover_next_attempt_tick = 0U;
static uint32_t g_ui_last_session_epoch = 0U;
static uint8_t g_ui_last_session_valid = 0U;

static SystemConfig_t g_sys_cfg;
static uint8_t g_sys_cfg_loaded = 0U;

static arm_rfft_fast_instance_f32 S;
static uint8_t fft_initialized = 0U;
static uint8_t channels_metadata_initialized = 0U;
static float32_t fft_input_buf[WAVEFORM_POINTS] AXI_SRAM_SECTION;
static float32_t fft_output_buf[WAVEFORM_POINTS] AXI_SRAM_SECTION;
static float32_t fft_mag_buf[WAVEFORM_POINTS] AXI_SRAM_SECTION;

static inline void ESP_RtosYield(void)
{
    if ((osKernelGetState() == osKernelRunning) && (__get_IPSR() == 0U))
    {
        osDelay(1);
    }
}

static void ESP_LoadConfig(void)
{
    if (g_sys_cfg_loaded)
    {
        return;
    }

    SD_Config_SetDefaults(&g_sys_cfg);
    g_sys_cfg_loaded = 1U;
}

