lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
    ESP_UploadMode_ApplyLoaded(full);
    ESP_Log("[ESP] upload mode loaded from SD: %s\r\n", full ? "full" : "summary");
    return true;
}

static bool ESP_UploadMode_SaveToSD(uint8_t full)
{
    if (!esp_sd_try_mount(200U)) {
        return false;
    }
    if (esp_cfg_ensure_dir() != FR_OK) {
        return false;
    }

    FIL fil;
    if (f_open(&fil, UI_UPLOAD_TMP_FILE, FA_CREATE_ALWAYS | FA_WRITE) != FR_OK) {
        return false;
    }

    char buf[64];
    int n = snprintf(buf, sizeof(buf),
                     "REPORT_MODE=%s\r\n",
                     full ? "full" : "summary");
    if (n <= 0 || n >= (int)sizeof(buf)) {
        (void)f_close(&fil);
        (void)f_unlink(UI_UPLOAD_TMP_FILE);
        return false;
    }

    UINT bw = 0;
    FRESULT wr = f_write(&fil, buf, (UINT)n, &bw);
    FRESULT sr = f_sync(&fil);
    (void)f_close(&fil);
    if (wr != FR_OK || sr != FR_OK || bw != (UINT)n) {
        (void)f_unlink(UI_UPLOAD_TMP_FILE);
        return false;
    }

    (void)f_unlink(UI_UPLOAD_CFG_FILE);
    FRESULT rn = f_rename(UI_UPLOAD_TMP_FILE, UI_UPLOAD_CFG_FILE);
    if (rn != FR_OK) {
        (void)f_unlink(UI_UPLOAD_TMP_FILE);
        return false;
    }
    return true;
}

bool ESP_Config_LoadFromSD_UIFiles(void)
{
    if (!esp_sd_try_mount(120U)) {
        return false;
    }

    /* 以当前配置为基底（若未加载则会先装载默认值） */
    SystemConfig_t cfg = *ESP_Config_Get();
    bool wifi_loaded = false;
    bool server_loaded = false;

    /* WiFi */
    {
        FIL fil;
        if (f_open(&fil, UI_WIFI_CFG_FILE, FA_READ) == FR_OK) {
            char line[160];
            while (f_gets(line, sizeof(line), &fil)) {
                cfg_rstrip(line);
                if (strncmp(line, "SSID=", 5) == 0) {
                    strncpy(cfg.wifi_ssid, line + 5, sizeof(cfg.wifi_ssid) - 1);
                    cfg.wifi_ssid[sizeof(cfg.wifi_ssid) - 1] = '\0';
                } else if (strncmp(line, "PWD=", 4) == 0) {
                    strncpy(cfg.wifi_password, line + 4, sizeof(cfg.wifi_password) - 1);
                    cfg.wifi_password[sizeof(cfg.wifi_password) - 1] = '\0';
                }
            }
            (void)f_close(&fil);
            wifi_loaded = true;
        }
    }

    /* Server */
    {
        FIL fil;
        if (f_open(&fil, UI_SERVER_CFG_FILE, FA_READ) == FR_OK) {
            char line[160];
            while (f_gets(line, sizeof(line), &fil)) {
                cfg_rstrip(line);
                if (strncmp(line, "IP=", 3) == 0) {
                    strncpy(cfg.server_ip, line + 3, sizeof(cfg.server_ip) - 1);
                    cfg.server_ip[sizeof(cfg.server_ip) - 1] = '\0';
                } else if (strncmp(line, "PORT=", 5) == 0) {
                    uint32_t v;
                    if (cfg_parse_u32_relaxed(line + 5, &v) && v > 0U && v <= 65535U) {
                        cfg.server_port = (uint16_t)v;
                    }
                } else if (strncmp(line, "ID=", 3) == 0) {
                    strncpy(cfg.node_id, line + 3, sizeof(cfg.node_id) - 1);
                    cfg.node_id[sizeof(cfg.node_id) - 1] = '\0';
                } else if (strncmp(line, "LOC=", 4) == 0) {
                    strncpy(cfg.node_location, line + 4, sizeof(cfg.node_location) - 1);
                    cfg.node_location[sizeof(cfg.node_location) - 1] = '\0';
                }
            }
            (void)f_close(&fil);
            server_loaded = true;
        }
    }

    if (wifi_loaded && server_loaded) {
        ESP_Config_Apply(&cfg);
    } else {
        ESP_Log("[ESP_CFG] SD config incomplete: wifi=%u server=%u\r\n",
                wifi_loaded ? 1U : 0U,
                server_loaded ? 1U : 0U);
    }
    (void)ESP_UploadMode_LoadFromSD();
    return (wifi_loaded && server_loaded);
}

static bool ESP_Config_IsValidForLink(const SystemConfig_t *cfg)
{
    if (cfg == NULL) return false;
    if (cfg->wifi_ssid[0] == '\0') return false;
    if (cfg->server_ip[0] == '\0') return false;
    if (cfg->server_port == 0U) return false;
    if (cfg->node_id[0] == '\0') return false;
    return true;
}

bool ESP_Config_LoadRuntimeFromSD(void)
{
    bool cfg_ok;
    bool comm_ok;
    const SystemConfig_t *cfg;

    ESP_LoadConfig();
    cfg_ok = ESP_Config_LoadFromSD_UIFiles();
    comm_ok = ESP_CommParams_LoadFromSD();
    (void)ESP_UploadMode_LoadFromSD();

    cfg = ESP_Config_Get();
    if (!ESP_Config_IsValidForLink(cfg)) {
        ESP_Log("[ESP_CFG] runtime SD load invalid: cfg_ok=%u ssid=%u host=%u port=%u node=%u\r\n",
                cfg_ok ? 1U : 0U,
                (cfg && cfg->wifi_ssid[0]) ? 1U : 0U,
                (cfg && cfg->server_ip[0]) ? 1U : 0U,
                (cfg && cfg->server_port) ? 1U : 0U,
                (cfg && cfg->node_id[0]) ? 1U : 0U);
        return false;
    }
    if (!cfg_ok) {
        ESP_Log("[ESP_CFG] SD UI config incomplete; using current runtime link config.\r\n");
    }

    if (!comm_ok) {
        ESP_Log("[ESP_CFG] ui_param.cfg missing/unreadable; using runtime/default comm params.\r\n");
    }
    return true;
}

/* Utility functions. */

/* Debug console uses USART1 only; ESP32 transport is SPI. */
static UART_HandleTypeDef *ESP_GetLogUart(void)
{
#if (ESP_LOG_UART_PORT == 1)
    extern UART_HandleTypeDef huart1;
    return &huart1;
#else
    return NULL;
#endif
}

/* ================= 核心代码 ================= */

/**
 * @brief  EdgeComm 初始化主流程
 */
#if 0
/* 通用波形生成与FFT计算函数（已停用：改为 ADS131A04 真实采样） */
static void Process_Channel_Data(int ch_id, float base_dc, float ripple_amp, float noise_level)
{
    static float time_t = 0.0f;
    float noise;
    int i;

    // 模拟瞬时值波动 (低频慢变化)
    node_channels[ch_id].current_value = base_dc + ripple_amp * 0.1f * arm_sin_f32(2.0f * PI * 0.5f * time_t);

    // 1. 生成波形 (50Hz + 150Hz谐波 + 噪声)
    for (i = 0; i < WAVEFORM_POINTS; i++)
    {
        // 基础噪声
        noise = ((float)(rand() % 100) / 100.0f - 0.5f) * noise_level;

        // 漏电流特殊处理：加一些随机尖峰
        if (ch_id == 3 && (rand() % 100) > 98)
        {
            noise += 5.0f; // 突发漏电尖峰
        }

