lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
        // 信号组合：直流基准 + 50Hz纹波 + 150Hz谐波 + 噪声
        float phase = (float)ch_id * 0.5f; // 不同通道相位错开

        node_channels[ch_id].waveform[i] = node_channels[ch_id].current_value + ripple_amp * arm_sin_f32(2.0f * PI * 50.0f * ((float)i * 0.0005f) + phase) + (ripple_amp * 0.3f) * arm_sin_f32(2.0f * PI * 150.0f * ((float)i * 0.0005f)) + noise;
    }

    // 2. FFT 计算 (使用 CMSIS-DSP 库)
    arm_rfft_fast_f32(&S, node_channels[ch_id].waveform, fft_output_buf, 0);
    arm_cmplx_mag_f32(fft_output_buf, fft_mag_buf, WAVEFORM_POINTS / 2);

    // 3. 填充 FFT (归一化处理)
    node_channels[ch_id].fft_data[0] = 0; // 去直流分量
    for (i = 1; i < FFT_POINTS; i++)
    {
        // 归一化公式：幅度 = (FFT模值 / (N/2)) * 2
        node_channels[ch_id].fft_data[i] = (fft_mag_buf[i] / (float)(WAVEFORM_POINTS / 2)) * 2.0f;
    }

    // 4. 恢复波形 (因为 arm_rfft_fast_f32 是 In-Place 运算，会破坏原 buffer)
    // 这里为了 JSON 发送原始波形，需要重新生成一遍
    double sum = 0.0;
    for (i = 0; i < WAVEFORM_POINTS; i++)
    {
        float phase = (float)ch_id * 0.5f;
        float y = node_channels[ch_id].current_value +
                  ripple_amp * arm_sin_f32(2.0f * PI * 50.0f * ((float)i * 0.0005f) + phase) +
                  (ripple_amp * 0.3f) * arm_sin_f32(2.0f * PI * 150.0f * ((float)i * 0.0005f));
        node_channels[ch_id].waveform[i] = y;
        sum += (double)y;
    }

    /* 卡片显示值改为“本帧波形平均值（mean）”
     * - 之前 current_value 是模拟瞬时值（带慢变化），不是严格平均值
     * - 这里用 mean 更符合“平均值”语义，并且对噪声/非整周期截断更鲁棒 */
    node_channels[ch_id].current_value = ESP_SafeFloat((float)(sum / (double)WAVEFORM_POINTS));

    if (ch_id == 3)
        time_t += 0.05f; // 时间步进
}
#endif

void ESP_Update_Data_And_FFT(void)
{
    static uint32_t last_calc_tick = 0;
    static uint32_t last_dsp_log_tick = 0;
    static uint32_t last_zero_window_log_tick = 0;
    static uint8_t last_ready = 0;
    uint32_t min_itv = ESP_ALGO_MIN_INTERVAL_MS;
    uint32_t now = HAL_GetTick();

    ESP_Init_Channels_And_DSP();

    uint8_t ready = 0;
    float (*src)[WAVEFORM_POINTS] = NULL;
    const float *aux4 = s_ai_default_aux4;
    uint8_t aux4_valid_mask = 0U;
    if (ADS131A04_flag == 1 && last_ready != 1)
    {
        ready = 1;
        src = ADSA_B;
        aux4 = ADSA_AUX4;
        aux4_valid_mask = ADSA_AUX4_valid_mask;
    }
    else if (ADS131A04_flag2 == 2 && last_ready != 2)
    {
        ready = 2;
        src = ADSA_B2;
        aux4 = ADSA_AUX4_2;
        aux4_valid_mask = ADSA_AUX4_2_valid_mask;
    }
    else
    {
        return;
    }

    if (min_itv > 0u)
    {
        if ((now - last_calc_tick) < min_itv)
        {
            return;
        }
    }
    last_calc_tick = now;

    if (ESP_AcquisitionWindowAllZero(src))
    {
        last_ready = ready;
        if ((now - last_zero_window_log_tick) >= 1000U)
        {
            last_zero_window_log_tick = now;
            ESP_Log("[AD7606] all-zero acquisition window suppressed ready=%u raw=[%04X,%04X,%04X,%04X] flags=%d/%d idx=%d/%d\r\n",
                    (unsigned int)ready,
                    (unsigned int)AD7606_DebugRaw[0],
                    (unsigned int)AD7606_DebugRaw[1],
                    (unsigned int)AD7606_DebugRaw[2],
                    (unsigned int)AD7606_DebugRaw[3],
                    ADS131A04_flag,
                    ADS131A04_flag2,
                    number,
                    number2);
        }
        return;
    }

    ESP_AI_UpdateFaultCode((const float (*)[AD_ACQ_POINTS])src, aux4, aux4_valid_mask);
    ESP_RtosYield();

    double sum0 = 0.0, sum1 = 0.0, sum2 = 0.0, sum3 = 0.0;
    double ssq0 = 0.0, ssq1 = 0.0, ssq2 = 0.0, ssq3 = 0.0;
    float min0 = 0.0f, min1 = 0.0f, min2 = 0.0f, min3 = 0.0f;
    float max0 = 0.0f, max1 = 0.0f, max2 = 0.0f, max3 = 0.0f;
    for (int i = 0; i < WAVEFORM_POINTS; i++)
    {
        float v0 = EW_AnalogVToPhysicalEngineering(0U, src[0][i]);
        float v1 = EW_AnalogVToPhysicalEngineering(1U, src[1][i]);
        float v2 = EW_AnalogVToPhysicalEngineering(2U, src[2][i]);
        float v3 = EW_AnalogVToPhysicalEngineering(3U, src[3][i]);
        if (i == 0)
        {
            min0 = max0 = v0;
            min1 = max1 = v1;
            min2 = max2 = v2;
            min3 = max3 = v3;
        }
        else
        {
            if (v0 < min0) min0 = v0;
            if (v0 > max0) max0 = v0;
            if (v1 < min1) min1 = v1;
            if (v1 > max1) max1 = v1;
            if (v2 < min2) min2 = v2;
            if (v2 > max2) max2 = v2;
            if (v3 < min3) min3 = v3;
            if (v3 > max3) max3 = v3;
        }
#if (ESP_PRINT_WAVEFORM_POINTS)
        /* 瞬时值(每点)：默认每点都打；可通过 ESP_PRINT_POINT_STEP 降频 */
        if ((ESP_PRINT_POINT_STEP <= 1) || ((i % ESP_PRINT_POINT_STEP) == 0))
        {
            printf("%f,%f,%f,%f\r\n", (double)v0, (double)v1, (double)v2, (double)v3);
        }
#endif
        node_channels[0].waveform[i] = v0;
        node_channels[1].waveform[i] = v1;
        node_channels[2].waveform[i] = v2;
        node_channels[3].waveform[i] = v3;
        sum0 += (double)v0;
        sum1 += (double)v1;
        sum2 += (double)v2;
        sum3 += (double)v3;
        ssq0 += (double)v0 * (double)v0;
        ssq1 += (double)v1 * (double)v1;
        ssq2 += (double)v2 * (double)v2;
        ssq3 += (double)v3 * (double)v3;
        /* 每 1024 点让出 CPU，避免长时间占用导致 UI 卡死（4096 点波形） */
        if ((i + 1) % 1024 == 0)
            ESP_RtosYield();
    }

    node_channels[0].current_value = ESP_SafeFloat((float)(sum0 / (double)WAVEFORM_POINTS));
    node_channels[1].current_value = ESP_SafeFloat((float)(sum1 / (double)WAVEFORM_POINTS));
    node_channels[2].current_value = ESP_SafeFloat((float)(sum2 / (double)WAVEFORM_POINTS));
    node_channels[3].current_value = ESP_SafeFloat((float)(sum3 / (double)WAVEFORM_POINTS));

    for (int ch = 0; ch < 4; ch++)
    {
        memcpy(fft_input_buf, node_channels[ch].waveform, sizeof(fft_input_buf));
        arm_rfft_fast_f32(&S, fft_input_buf, fft_output_buf, 0);
        arm_cmplx_mag_f32(fft_output_buf, fft_mag_buf, WAVEFORM_POINTS / 2);
        node_channels[ch].fft_data[0] = 0;
        for (int i = 1; i < FFT_POINTS; i++)
        {
            node_channels[ch].fft_data[i] = (fft_mag_buf[i] / (float)(WAVEFORM_POINTS / 2)) * 2.0f;
        }
        /* 每通道 FFT 完成后让出 CPU，避免 4 通道连续计算导致 UI 卡死 */
        ESP_RtosYield();
    }

