lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
    last_ready = ready;
    ESP_UploadSnapshot_PublishFromNodeChannels(ready);
    if ((HAL_GetTick() - last_dsp_log_tick) >= EDGEWIND_DSP_SNAPSHOT_LOG_MS)
    {
        last_dsp_log_tick = HAL_GetTick();
        float rms0 = sqrtf((float)(ssq0 / (double)WAVEFORM_POINTS));
        float rms1 = sqrtf((float)(ssq1 / (double)WAVEFORM_POINTS));
        float rms2 = sqrtf((float)(ssq2 / (double)WAVEFORM_POINTS));
        float rms3 = sqrtf((float)(ssq3 / (double)WAVEFORM_POINTS));
        uint16_t raw0 = AD7606_DebugRaw[0];
        uint16_t raw1 = AD7606_DebugRaw[1];
        uint16_t raw2 = AD7606_DebugRaw[2];
        uint16_t raw3 = AD7606_DebugRaw[3];
        uint16_t raw4 = AD7606_DebugRaw[4];
        uint16_t raw5 = AD7606_DebugRaw[5];
        uint16_t raw6 = AD7606_DebugRaw[6];
        uint16_t raw7 = AD7606_DebugRaw[7];
        float av0 = AD7606_DebugVolts[0];
        float av1 = AD7606_DebugVolts[1];
        float av2 = AD7606_DebugVolts[2];
        float av3 = AD7606_DebugVolts[3];
        float av4 = AD7606_DebugVolts[4];
        float av5 = AD7606_DebugVolts[5];
        float av6 = AD7606_DebugVolts[6];
        float av7 = AD7606_DebugVolts[7];
        ESP_Log("[DSP] snapshot seq=%lu pub=%lu drop=%lu ready=%u dt=%lums cv=[%.1f,%.1f,%.1f,%.1f] rms=[%.1f,%.1f,%.1f,%.1f] range=[%.1f..%.1f,%.1f..%.1f,%.1f..%.1f,%.1f..%.1f] aux4=[%.1f,%.1f,%.1f,%.1f] aux_valid=0x%02X adc_raw=[%04X,%04X,%04X,%04X,%04X,%04X,%04X,%04X] adc_v=[%.5f,%.5f,%.5f,%.5f,%.5f,%.5f,%.5f,%.5f] flags=%d/%d idx=%d/%d busy=%u db7=%u\r\n",
                (unsigned long)g_upload_snapshot_seq,
                (unsigned long)g_upload_snapshot_publish_count,
                (unsigned long)g_upload_snapshot_drop_count,
                (unsigned int)ready,
                (unsigned long)(HAL_GetTick() - now),
                (double)node_channels[0].current_value,
                (double)node_channels[1].current_value,
                (double)node_channels[2].current_value,
                (double)node_channels[3].current_value,
                (double)rms0,
                (double)rms1,
                (double)rms2,
                (double)rms3,
                (double)min0,
                (double)max0,
                (double)min1,
                (double)max1,
                (double)min2,
                (double)max2,
                (double)min3,
                (double)max3,
                (double)aux4[0],
                (double)aux4[1],
                (double)aux4[2],
                (double)aux4[3],
                (unsigned int)aux4_valid_mask,
                (unsigned int)raw0,
                (unsigned int)raw1,
                (unsigned int)raw2,
                (unsigned int)raw3,
                (unsigned int)raw4,
                (unsigned int)raw5,
                (unsigned int)raw6,
                (unsigned int)raw7,
                (double)av0,
                (double)av1,
                (double)av2,
                (double)av3,
                (double)av4,
                (double)av5,
                (double)av6,
                (double)av7,
                ADS131A04_flag,
                ADS131A04_flag2,
                number,
                number2,
                (unsigned int)AD7606_DebugBusy,
                (unsigned int)AD7606_DebugDb7);
    }
}

static void StrTrimInPlace(char *s)
{
    if (!s)
        return;
    // trim left
    char *p = s;
    while (*p == ' ' || *p == '\t' || *p == '\r' || *p == '\n')
        p++;
    if (p != s)
        memmove(s, p, strlen(p) + 1);
    // trim right
    size_t n = strlen(s);
    while (n > 0)
    {
        char c = s[n - 1];
        if (c == ' ' || c == '\t' || c == '\r' || c == '\n')
        {
            s[n - 1] = 0;
            n--;
        }
        else
            break;
    }
}

static void ESP_SPI_FullArmFrames(uint16_t frames)
{
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    uint32_t next;

    if (frames == 0U) {
        frames = 1U;
    }
    next = (uint32_t)g_spi_full_manual_frames + (uint32_t)frames;
    if (next > 1000U) {
        next = 1000U;
    }
    g_spi_full_manual_frames = (uint16_t)next;
    ESP_SetServerReportMode(1U);
    ESP_Log("[ESP32SPI] full armed: pending=%u continuous=%u\r\n",
            (unsigned int)g_spi_full_manual_frames,
            (unsigned int)g_spi_full_continuous);
#else
    (void)frames;
    ESP_Log("[ESP32SPI] full upload is not compiled in this build.\r\n");
#endif
}

static void ESP_SPI_FullSetContinuous(uint8_t enable)
{
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    g_spi_full_continuous = enable ? 1U : 0U;
    if (g_spi_full_continuous) {
        ESP_SetServerReportMode(1U);
    } else {
        g_spi_full_manual_frames = 0U;
        ESP_SetServerReportMode(0U);
    }
    ESP_Log("[ESP32SPI] full continuous=%u pending=%u\r\n",
            (unsigned int)g_spi_full_continuous,
            (unsigned int)g_spi_full_manual_frames);
#else
    (void)enable;
    ESP_Log("[ESP32SPI] full upload is not compiled in this build.\r\n");
#endif
}

static void ESP_SPI_FullPrintStatus(void)
{
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    (void)ESP_SPI_FullClearStaleWaitState("status");
    (void)ESP_SPI_FullClearBlockedTxState("status", (g_esp_ready == 0U) ? 1U : 0U);
    ESP_Log("[ESP32SPI] full status: requested=%u continuous=%u pending=%u reporting=%u ready=%u active=%u phase=%u\r\n",
            (unsigned int)g_server_report_full,
            (unsigned int)g_spi_full_continuous,
            (unsigned int)g_spi_full_manual_frames,
            (unsigned int)ESP_UI_IsReporting(),
            (unsigned int)g_esp_ready,
            (unsigned int)g_full_tx_sm.active,
            (unsigned int)g_full_tx_sm.phase);
    if (g_spi_full_waiting_result != 0U) {
        ESP_Log("[ESP32SPI] full waiting: frame=%lu ref=%lu elapsed=%lums\r\n",
                (unsigned long)g_spi_full_result_frame_id,
                (unsigned long)g_spi_full_result_ref_seq,
                (unsigned long)(HAL_GetTick() - g_spi_full_result_start_tick));
    }
#else
    ESP_Log("[ESP32SPI] full upload is not compiled in this build.\r\n");
#endif
}

