lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
    if (g_full_tx_sm.active == 0U) {
        return 0U;
    }

    now = HAL_GetTick();
    elapsed = now - g_full_tx_sm.start_tick;
    if (link_not_ready != 0U) {
        reason = "link_not_ready";
    } else if (g_full_tx_sm.start_tick == 0U || elapsed >= ESP32_SPI_FULL_TX_STALE_MS) {
        reason = "tx_stale";
    }

    if (reason == NULL) {
        return 0U;
    }

    ESP_Log("[ESP32SPI] blocked full tx cleared ctx=%s frame=%lu snap=%lu elapsed=%lums phase=%u pkt=%lu reason=%s\r\n",
            (context != NULL) ? context : "unknown",
            (unsigned long)g_full_tx_sm.frame_id,
            (unsigned long)g_full_tx_sm.snapshot_seq,
            (unsigned long)elapsed,
            (unsigned int)g_full_tx_sm.phase,
            (unsigned long)g_full_tx_sm.packet_count,
            reason);
    ESP_FullTx_ClearAndRelease();
    if (g_spi_full_busy_nack_count < 1000000UL) {
        g_spi_full_busy_nack_count++;
    }
    return 1U;
}

static void ESP_SPI_FullResetUploadRuntimeState(void)
{
    ESP_SPI_FullClearWaitState();
    g_spi_full_holdoff_until_tick = 0U;
    g_spi_full_timeout_count = 0U;
    g_spi_full_busy_nack_count = 0U;
    g_spi_full_http_fail_count = 0U;
    ESP_FullTx_ClearAndRelease();
}

static void ESP_SPI_FullEnterHoldoff(const char *reason, uint32_t holdoff_ms)
{
    uint32_t now = HAL_GetTick();

    if (holdoff_ms == 0U)
    {
        holdoff_ms = ESP32_SPI_FULL_BUSY_HOLDOFF_MS;
    }
    if (holdoff_ms > ESP32_SPI_FULL_MAX_HOLDOFF_MS)
    {
        holdoff_ms = ESP32_SPI_FULL_MAX_HOLDOFF_MS;
    }
    g_spi_full_holdoff_until_tick = now + holdoff_ms;
    ESP_Log("[ESP32SPI] full recovery holdoff=%lums reason=%s timeout=%lu busy=%lu httpfail=%lu\r\n",
            (unsigned long)holdoff_ms,
            (reason != NULL) ? reason : "unknown",
            (unsigned long)g_spi_full_timeout_count,
            (unsigned long)g_spi_full_busy_nack_count,
            (unsigned long)g_spi_full_http_fail_count);
    (void)ESP32_SPI_PollEvents(50U);
}

static bool ESP_SPI_FullHoldoffActive(uint32_t now_tick)
{
    if (g_spi_full_holdoff_until_tick == 0U)
    {
        return false;
    }
    if ((int32_t)(now_tick - g_spi_full_holdoff_until_tick) < 0)
    {
        return true;
    }
    g_spi_full_holdoff_until_tick = 0U;
    ESP_Log("[ESP32SPI] full recovery holdoff ended\r\n");
    return false;
}

static uint8_t ESP_SPI_FullControlBusy(void)
{
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    (void)ESP_SPI_FullClearStaleWaitState("control");
    (void)ESP_SPI_FullClearBlockedTxState("control", (g_esp_ready == 0U) ? 1U : 0U);
    if (g_spi_full_holdoff_until_tick != 0U) {
        (void)ESP_SPI_FullHoldoffActive(HAL_GetTick());
    }
#endif
    return (g_full_tx_sm.active != 0U ||
            g_spi_full_waiting_result != 0U ||
            g_spi_full_holdoff_until_tick != 0U) ? 1U : 0U;
}

static void ESP_SPI_QueueCommParamsSync(const ESP_CommParams_t *p)
{
    if (p == NULL) {
        return;
    }
    taskENTER_CRITICAL();
    g_spi_pending_comm_params = *p;
    g_spi_comm_params_sync_pending = 1U;
    taskEXIT_CRITICAL();
}

static void ESP_SPI_QueueReportModeSync(uint8_t full)
{
    taskENTER_CRITICAL();
    g_spi_report_mode_sync_target = (full != 0U) ? 1U : 0U;
    g_spi_report_mode_sync_pending = 1U;
    taskEXIT_CRITICAL();
}

static void ESP_SPI_ServiceDeferredSync(void)
{
    uint8_t do_comm_sync = 0U;
    uint8_t do_report_sync = 0U;
    uint8_t report_target = 0U;
    ESP_CommParams_t pending_comm;

    if (!g_esp_ready || ESP_SPI_FullControlBusy()) {
        return;
    }

    taskENTER_CRITICAL();
    if (g_spi_comm_params_sync_pending != 0U) {
        pending_comm = g_spi_pending_comm_params;
        g_spi_comm_params_sync_pending = 0U;
        do_comm_sync = 1U;
    }
    if (g_spi_report_mode_sync_pending != 0U) {
        report_target = g_spi_report_mode_sync_target;
        g_spi_report_mode_sync_pending = 0U;
        do_report_sync = 1U;
    }
    taskEXIT_CRITICAL();

    if (do_comm_sync != 0U) {
        if (!ESP32_SPI_ApplyCommParams(pending_comm.heartbeat_ms,
                                       pending_comm.min_interval_ms,
                                       pending_comm.http_timeout_ms,
                                       3000U,
                                       pending_comm.wave_step,
                                       pending_comm.upload_points,
                                       pending_comm.hardreset_sec,
                                       pending_comm.chunk_kb,
                                       pending_comm.chunk_delay_ms)) {
            ESP_Log("[ESP32SPI] deferred comm params sync failed, retry later\r\n");
            ESP_SPI_QueueCommParamsSync(&pending_comm);
            ESP_SPI_FullEnterHoldoff("deferred comm sync failed",
                                     ESP32_SPI_FULL_BUSY_HOLDOFF_MS);
            return;
        }
    }

    if (do_report_sync != 0U && g_report_enabled != 0U) {
        if (g_spi_full_waiting_result == 0U) {
            ESP_SPI_FullResetUploadRuntimeState();
        }
        if (!ESP32_SPI_StartReport(report_target, 3000U)) {
            ESP_Log("[ESP32SPI] deferred report mode sync failed, retry later\r\n");
            ESP_SPI_QueueReportModeSync(report_target);
            ESP_SPI_FullEnterHoldoff("deferred report sync failed",
                                     ESP32_SPI_FULL_BUSY_HOLDOFF_MS);
            return;
        }
    }
}
#endif

static void ESP_SetServerDownsampleStep(uint32_t step)
{
    if (step < 1U) step = 1U;
    if (step > 64U) step = 64U;
    /* Always apply a cloud command.  The current runtime value is authoritative
       and may differ from this command-cache after SD restore. */
    g_server_downsample_step = step;
    g_server_downsample_dirty = 1U;
}

static bool ESP_TryParseDownsampleStep(const char *s, uint32_t *out_step)
{
    if (!s || !out_step) {
        return false;
    }

    const char *p = strstr(s, "\"downsample_step\"");
    if (!p) {
        return false;
    }
    p += strlen("\"downsample_step\"");
    while (*p == ' ' || *p == '\t' || *p == '\r' || *p == '\n') p++;
    if (*p != ':') {
        return false;
    }
    p++;
    while (*p == ' ' || *p == '\t' || *p == '\r' || *p == '\n') p++;
    if (*p < '0' || *p > '9') {
        return false;
    }

    uint32_t step = 0;
    while (*p >= '0' && *p <= '9')
    {
        step = (step * 10U) + (uint32_t)(*p - '0');
        if (step > 9999U) {
            break;
        }
        p++;
    }

