lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
    if (step < 1U) step = 1U;
    if (step > 64U) step = 64U;
    *out_step = step;
    return true;
}

static void ESP_SetServerUploadPoints(uint32_t points)
{
    uint32_t maxp = (uint32_t)WAVEFORM_POINTS;
    if (maxp == 0u) {
        points = 0u;
    } else if (maxp < 256u) {
        points = maxp;
    } else {
        if (points < 256u) points = 256u;
        if (points > maxp) points = maxp;
        /* 容错：非 256 步进时就近取整到 256 倍数 */
        points = ((points + 128u) / 256u) * 256u;
        if (points < 256u) points = 256u;
        if (points > maxp) points = maxp;
    }

    /* Always apply a cloud command.  This fixes the 2048 -> 4096 case after
       reboot/SD restore: g_comm_upload_points can be 2048 while this cache is
       still the default 4096, and the old comparison dropped the command. */
    g_server_upload_points = points;
    g_server_upload_points_dirty = 1U;
}

static bool ESP_TryParseUploadPoints(const char *s, uint32_t *out_points)
{
    if (!s || !out_points) {
        return false;
    }

    const char *p = strstr(s, "\"upload_points\"");
    if (!p) {
        return false;
    }
    p += strlen("\"upload_points\"");
    while (*p == ' ' || *p == '\t' || *p == '\r' || *p == '\n') p++;
    if (*p != ':') {
        return false;
    }
    p++;
    while (*p == ' ' || *p == '\t' || *p == '\r' || *p == '\n') p++;
    if (*p < '0' || *p > '9') {
        return false;
    }

    uint32_t points = 0;
    while (*p >= '0' && *p <= '9')
    {
        points = (points * 10U) + (uint32_t)(*p - '0');
        if (points > 10000000U) {
            break;
        }
        p++;
    }

    *out_points = points;
    return true;
}

static void ESP_SPI_ApplyCommParamsToCoprocessor(const ESP_CommParams_t *p)
{
    if (!p || !g_esp_ready) {
        return;
    }
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    if (ESP_SPI_FullControlBusy()) {
        ESP_SPI_QueueCommParamsSync(p);
        return;
    }
#endif
    if (!ESP32_SPI_ApplyCommParams(p->heartbeat_ms,
                                   p->min_interval_ms,
                                   p->http_timeout_ms,
                                   3000U,
                                   p->wave_step,
                                   p->upload_points,
                                   p->hardreset_sec,
                                   p->chunk_kb,
                                   p->chunk_delay_ms)) {
        ESP_Log("[ESP32SPI] comm params sync failed\r\n");
    }
}

void ESP_Console_Init(void)
{
#if (ESP_CONSOLE_ENABLE)
    UART_HandleTypeDef *hu = ESP_GetLogUart(); // 默认 USART1
    if (!hu)
        return;

    // 启动 1 字节 RX 中断（比主循环轮询稳定，避免“输入了但没反应”）
    HAL_UART_Receive_IT(hu, &g_console_rx_byte, 1);
    ESP_Log("[控制台] 已启用：输入 E01 回车注入故障；输入 E00 回车清除。\r\n");
#endif
}

/**
 * @brief  控制台轮询任务
 * @note   在主循环中调用，处理用户输入和服务器指令
 */
void ESP_Console_Poll(void)
{
#if (ESP_CONSOLE_ENABLE)
    uint32_t now = HAL_GetTick();
    uint8_t server_cmd_seen = 0U;
    uint8_t server_cmd_saved = 0U;
    uint8_t server_cmd_save_failed = 0U;
    uint8_t server_cmd_applied = 0U;
    static char server_cmd_summary[192];

    server_cmd_summary[0] = '\0';
    ESP_ServerCommandLogRestore(server_cmd_summary,
                                sizeof(server_cmd_summary),
                                &server_cmd_seen,
                                &server_cmd_saved,
                                &server_cmd_save_failed,
                                &server_cmd_applied);
    // 1) 处理“已收到的一整行”控制台指令
    if (g_console_line_ready)
    {
        g_console_line_ready = 0;
        g_console_line[g_console_line_len] = 0;
        ESP_Console_HandleLine(g_console_line);
        g_console_line_len = 0;
    }

    {
        static uint32_t s_last_async_event_poll_tick = 0U;
        uint8_t can_apply_server_cmd = 1U;
        uint8_t reset = 0U, has_mode = 0U, full = 0U;
        uint8_t has_downsample = 0U, has_upload = 0U;
        uint8_t has_hb = 0U, has_min = 0U, has_http = 0U, has_chunk = 0U, has_chunk_delay = 0U;
        uint32_t downsample = 0U, upload_points = 0U;
        uint32_t hb_ms = 0U, min_ms = 0U, http_ms = 0U, chunk_kb = 0U, chunk_delay_ms = 0U;

        /* Async cloud events are delivered only when STM32 clocks the SPI link.
           In summary/idle periods there may be no full-frame result wait loop,
           so server commands can otherwise sit inside the ESP32 event queue for
           minutes.  Poll a lightweight NOOP regularly whenever the link is idle
           enough, so report_mode/upload_points/downsample commands become
           visible quickly in every operating mode. */
        if (g_esp_ready != 0U &&
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
            !ESP_SPI_FullControlBusy() &&
#endif
            ((now - s_last_async_event_poll_tick) >= 100U)) {
            s_last_async_event_poll_tick = now;
            (void)ESP32_SPI_PollEvents(10U);
        }

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
        can_apply_server_cmd = (ESP_SPI_FullControlBusy() == 0U) ? 1U : 0U;
#endif

        if (server_cmd_seen == 0U &&
            can_apply_server_cmd != 0U &&
            ESP32_SPI_ConsumeServerCommand(&reset,
                                           &has_mode,
                                           &full,
                                           &has_downsample,
                                           &downsample,
                                           &has_upload,
                                           &upload_points,
                                           &has_hb,
                                           &hb_ms,
                                           &has_min,
                                           &min_ms,
                                           &has_http,
                                           &http_ms,
                                            &has_chunk,
                                            &chunk_kb,
                                           &has_chunk_delay,
                                           &chunk_delay_ms)) {
            ESP_BuildServerCommandSummary(server_cmd_summary,
                                          sizeof(server_cmd_summary),
                                          reset,
                                          has_mode,
                                          full,
                                          has_downsample,
                                          downsample,
                                          has_upload,
                                          upload_points,
                                          has_hb,
                                          hb_ms,
                                          has_min,
                                          min_ms,
                                          has_http,
                                          http_ms,
                                          has_chunk,
                                          chunk_kb,
                                          has_chunk_delay,
                                          chunk_delay_ms);
            if (!ESP_ServerCommandRecentlyApplied(server_cmd_summary, now)) {
                server_cmd_seen = 1U;
                ESP_ServerCommandLogStore(server_cmd_summary, server_cmd_seen, 0U, 0U, 0U);
                if (reset) {
                    g_server_reset_pending = 1U;
                }
                if (has_mode) {
                    ESP_SetServerReportMode(full);
                }
                if (has_downsample) {
                    ESP_SetServerDownsampleStep(downsample);
                }
                if (has_upload) {
                    ESP_SetServerUploadPoints(upload_points);
                }
                if (has_hb || has_min || has_http || has_chunk || has_chunk_delay) {
                    ESP_CommParams_t old_p;
                    ESP_CommParams_t p;
                    ESP_CommParams_Get(&old_p);
                    p = old_p;
                    if (has_hb) {
                        p.heartbeat_ms = hb_ms;
                    }
                    if (has_min) {
                        p.min_interval_ms = min_ms;
                    }
                    if (has_http) {
                        p.http_timeout_ms = http_ms;
                    }
                    if (has_chunk) {
                        p.chunk_kb = chunk_kb;
                    }
                    if (has_chunk_delay) {
                        p.chunk_delay_ms = chunk_delay_ms;
                    }
                    bool params_changed = !ESP_CommParams_Equals(&old_p, &p);
                    if (params_changed) {
                        ESP_CommParams_Apply(&p);
                        ESP_CommParams_Get(&p);
                        if (ESP_CommParams_SaveToSD()) {
                            server_cmd_saved = 1U;
                            ESP_SPI_ApplyCommParamsToCoprocessor(&p);
                            server_cmd_applied = 1U;
                        } else {
                            ESP_CommParams_Apply(&old_p);
                            server_cmd_save_failed = 1U;
                        }
                    } else {
                        ESP_SPI_ApplyCommParamsToCoprocessor(&p);
                        server_cmd_applied = 1U;
                    }
                }
            }
        }
    }

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    if (ESP_SPI_FullControlBusy()) {
        ESP_ServerCommandLogStore(server_cmd_summary,
                                  server_cmd_seen,
                                  server_cmd_saved,
                                  server_cmd_save_failed,
                                  server_cmd_applied);
        return;
    }
#endif

    // 2) 处理“服务器下发 reset”指令
    if (g_server_reset_pending)
    {
        g_server_reset_pending = 0;
        ESP_SetFaultCode("E00");
        server_cmd_applied = 1U;
    }

    // 2.0) Apply server-issued report_mode.
    if (g_server_report_full_dirty)
    {
        uint8_t full = g_server_report_full ? 1U : 0U;
        const char *mode_text = full ? "full" : "summary";
        uint8_t mode_persist_changed = 1U;
        g_server_report_full_dirty = 0;
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
        mode_persist_changed = (g_spi_full_continuous != full) ? 1U : 0U;
#endif
        if (mode_persist_changed != 0U) {
            if (!ESP_UploadMode_SaveToSD(full)) {
                server_cmd_save_failed = 1U;
                if (server_cmd_seen != 0U) {
                    ESP_Log("[SERVER_CMD] save_failed: %s\r\n", server_cmd_summary);
                }
            } else {
                server_cmd_saved = 1U;
            }
        }
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
        g_spi_full_continuous = full;
        if (!full) {
            g_spi_full_manual_frames = 0U;
            if (g_spi_full_waiting_result == 0U && g_full_tx_sm.active == 0U) {
                ESP_SPI_FullResetUploadRuntimeState();
            }
        }
#endif
        /* The final clean status log is emitted below.  Avoid an extra
         * user-visible UI log here.
         */
        if (g_esp_ready && g_report_enabled) {
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
            if (ESP_SPI_FullControlBusy()) {
                ESP_SPI_QueueReportModeSync(full);
            } else {
                if (g_spi_full_waiting_result == 0U) {
                    ESP_SPI_FullResetUploadRuntimeState();
                }
                if (!ESP32_SPI_StartReport(full, 3000U)) {
                    ESP_Log("[ESP32SPI] report mode sync failed: %s\r\n", mode_text);
                }
            }
#else
            if (!ESP32_SPI_StartReport(full, 3000U)) {
                ESP_Log("[ESP32SPI] report mode sync failed: %s\r\n", mode_text);
            }
#endif
        }
        server_cmd_applied = 1U;
    }

