lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
static bool ESP_FullTx_StepPacket(uint32_t timeout_ms)
{
    const ESP_UploadSnapshot_t *snapshot = g_full_tx_sm.snapshot;
    uint8_t ch_idx;
    uint16_t total;
    uint16_t max_elements;
    uint16_t count;
    bool ok;

    if (g_full_tx_sm.active == 0U || snapshot == NULL)
    {
        return true;
    }

    switch (g_full_tx_sm.phase)
    {
    case ESP_FULL_TX_BEGIN:
        ok = ESP32_SPI_ReportFullBegin(g_full_tx_sm.frame_id,
                                        (uint64_t)snapshot->tick_ms,
                                        g_full_tx_sm.wave_step,
                                        g_full_tx_sm.upload_points,
                                        snapshot->fault_code,
                                        snapshot->status_code,
                                        g_full_tx_sm.channels,
                                        g_full_tx_sm.channel_count,
                                        timeout_ms);
        if (!ok)
        {
            return false;
        }
        g_full_tx_sm.packet_count++;
        g_full_tx_sm.channel_index = 0U;
        g_full_tx_sm.element_offset = 0U;
        g_full_tx_sm.phase = ESP_FULL_TX_WAVE;
        return true;

    case ESP_FULL_TX_WAVE:
        ch_idx = g_full_tx_sm.channel_index;
        if (ch_idx >= g_full_tx_sm.channel_count)
        {
            g_full_tx_sm.phase = ESP_FULL_TX_END;
            return true;
        }
        total = g_full_tx_sm.channels[ch_idx].waveform_count;
        if (g_full_tx_sm.element_offset >= total)
        {
            g_full_tx_sm.element_offset = 0U;
            g_full_tx_sm.phase = ESP_FULL_TX_FFT;
            return true;
        }
        max_elements = ESP32_SPI_FullWaveChunkMaxElements();
        if (max_elements == 0U)
        {
            return false;
        }
        count = (uint16_t)(total - g_full_tx_sm.element_offset);
        if (count > max_elements)
        {
            count = max_elements;
        }
        ok = ESP32_SPI_ReportFullWaveChunk(g_full_tx_sm.frame_id,
                                           g_full_tx_sm.channels[ch_idx].channel_id,
                                           g_full_tx_sm.waves[ch_idx],
                                           g_full_tx_sm.element_offset,
                                           count,
                                           g_full_tx_sm.wave_step,
                                           g_full_tx_sm.wave_source_counts[ch_idx],
                                           timeout_ms);
        if (!ok)
        {
            return false;
        }
        g_full_tx_sm.packet_count++;
        g_full_tx_sm.element_offset = (uint16_t)(g_full_tx_sm.element_offset + count);
        if (g_full_tx_sm.element_offset >= total)
        {
            g_full_tx_sm.element_offset = 0U;
            g_full_tx_sm.phase = ESP_FULL_TX_FFT;
        }
        return true;

    case ESP_FULL_TX_FFT:
        ch_idx = g_full_tx_sm.channel_index;
        if (ch_idx >= g_full_tx_sm.channel_count)
        {
            g_full_tx_sm.phase = ESP_FULL_TX_END;
            return true;
        }
        total = g_full_tx_sm.channels[ch_idx].fft_count;
        if (g_full_tx_sm.element_offset >= total)
        {
            g_full_tx_sm.channel_index++;
            g_full_tx_sm.element_offset = 0U;
            g_full_tx_sm.phase = (g_full_tx_sm.channel_index >= g_full_tx_sm.channel_count) ?
                                  ESP_FULL_TX_END : ESP_FULL_TX_WAVE;
            return true;
        }
        max_elements = ESP32_SPI_FullFftChunkMaxElements();
        if (max_elements == 0U)
        {
            return false;
        }
        count = (uint16_t)(total - g_full_tx_sm.element_offset);
        if (count > max_elements)
        {
            count = max_elements;
        }
        ok = ESP32_SPI_ReportFullFftChunk(g_full_tx_sm.frame_id,
                                          g_full_tx_sm.channels[ch_idx].channel_id,
                                          g_full_tx_sm.ffts[ch_idx],
                                          g_full_tx_sm.element_offset,
                                          count,
                                          timeout_ms);
        if (!ok)
        {
            return false;
        }
        g_full_tx_sm.packet_count++;
        g_full_tx_sm.element_offset = (uint16_t)(g_full_tx_sm.element_offset + count);
        if (g_full_tx_sm.element_offset >= total)
        {
            g_full_tx_sm.channel_index++;
            g_full_tx_sm.element_offset = 0U;
            g_full_tx_sm.phase = (g_full_tx_sm.channel_index >= g_full_tx_sm.channel_count) ?
                                  ESP_FULL_TX_END : ESP_FULL_TX_WAVE;
        }
        return true;

    case ESP_FULL_TX_END:
        ok = ESP32_SPI_ReportFullEnd(g_full_tx_sm.frame_id,
                                      ESP32_SPI_FULL_END_ACCEPT_TIMEOUT_MS);
        if (!ok)
        {
            return false;
        }
        g_full_tx_sm.packet_count++;
        g_full_tx_sm.active = 0U;
        return true;

    default:
        return false;
    }
}
#endif

/**
 * @brief  数据发送主函数
 * @note   负责打包 JSON，通过 DMA 发送
 */
void ESP_Post_Summary(void)
{
    if (g_esp_ready == 0)
        return;

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    ESP_SPI_ServiceDeferredSync();
    /* Full-upload stress mode must not be mixed with summary packets.
       This keeps the 10-minute test as continuous full frames only. */
    if (!ESP_ServerReportFull() && g_spi_full_continuous) {
        g_server_report_full = 1U;
        ESP_Log("[ESP32SPI] full mode self-heal: continuous=1 requested=1\r\n");
        return;
    }
    if (ESP_ServerReportFull() || g_spi_full_continuous) {
        return;
    }
#endif

    {
    static uint32_t last_spi_send_time = 0;
    static uint32_t tx_try = 0, tx_ok = 0, tx_err = 0;
    static uint32_t last_tx_log = 0;
    static uint32_t s_spi_seq = 0;
    static uint8_t invalid_state_nack_count = 0U;
    uint32_t now_tick = HAL_GetTick();
    uint32_t min_itv = ESP_CommParams_MinIntervalMs();

    if (min_itv && (now_tick - last_spi_send_time < min_itv)) {
        return;
    }
    last_spi_send_time = now_tick;

    esp32_spi_report_channel_t ch[4];
    for (uint8_t i = 0; i < 4U; i++) {
        int32_t cv_i = ESP_FloatToI32Scaled(node_channels[i].current_value);
        ch[i].channel_id = node_channels[i].id;
        ch[i].waveform_count = (uint16_t)WAVEFORM_POINTS;
        ch[i].fft_count = (uint16_t)FFT_POINTS;
        ch[i].value_scaled = cv_i;
        ch[i].current_value_scaled = cv_i;
    }

    tx_try++;
    if (ESP32_SPI_ReportSummary(++s_spi_seq,
                                (uint64_t)now_tick,
                                ESP_CommParams_WaveStep(),
                                ESP_CommParams_UploadPoints(),
                                g_fault_code,
                                ESP_ServerReportFull() ? 1U : 0U,
                                1U,
                                ch,
                                4U,
                                1200U)) {
        tx_ok++;
        invalid_state_nack_count = 0U;
    } else {
        tx_err++;
        if (ESP32_SPI_GetLastNackReason() == ESP32_SPI_NACK_INVALID_STATE) {
            if (invalid_state_nack_count < 255U) {
                invalid_state_nack_count++;
            }
            if (invalid_state_nack_count >= ESP32_SPI_INVALID_STATE_AUTOSTOP_COUNT) {
                invalid_state_nack_count = 0U;
                ESP_SPI_ResetLocalReportState("summary NACK invalid_state");
                return;
            }
        } else {
            invalid_state_nack_count = 0U;
        }
    }

    if ((now_tick - last_tx_log) >= 1000U) {
        last_tx_log = now_tick;
        ESP_Log("[ESP32SPI] summary tx try=%lu ok=%lu err=%lu\r\n",
                (unsigned long)tx_try,
                (unsigned long)tx_ok,
                (unsigned long)tx_err);
    }
    return;
    }

