lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
// ---------------- Debug console input callback (USART1 only) ----------------
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
#if (ESP_CONSOLE_ENABLE)
    UART_HandleTypeDef *hu = ESP_GetLogUart();
    if (huart == hu)
    {
        // 若上一条命令还未被主循环处理，为避免覆盖缓冲区，先丢弃后续输入
        if (g_console_line_ready)
        {
            HAL_UART_Receive_IT(hu, &g_console_rx_byte, 1);
            return;
        }

        uint8_t ch = g_console_rx_byte;
        if (ch == '\r' || ch == '\n')
        {
            if (g_console_line_len > 0)
            {
                g_console_line_ready = 1;
            }
        }
        else
        {
            if (g_console_line_len < (sizeof(g_console_line) - 1))
            {
                g_console_line[g_console_line_len++] = (char)ch;
            }
            else
            {
                g_console_line_len = 0; // 溢出清空
            }
        }
        HAL_UART_Receive_IT(hu, &g_console_rx_byte, 1);
        return;
    }
#endif
    (void)huart;
}

static void ESP_Log(const char *format, ...)
{
    char log_buf[256];
    va_list args;
    va_start(args, format);
    vsnprintf(log_buf, sizeof(log_buf), format, args);
    va_end(args);
#if (ESP_DEBUG)
    // 直接打到指定调试串口（避免 printf 重定向配置不一致导致“看不到日志”）
    UART_HandleTypeDef *hu = ESP_GetLogUart();
    if (hu)
    {
        HAL_UART_Transmit(hu, (uint8_t *)log_buf, (uint16_t)strlen(log_buf), 100);
    }
    else
    {
        printf("%s", log_buf);
    }
#else
    (void)log_buf;
#endif

    /* 额外：推送给 UI（DeviceConnect 控制台） */
    ESP_UI_Internal_OnLog(log_buf);
}

/* ================= DeviceConnect(UI) 驱动实现 ================= */

typedef struct
{
    esp_ui_log_hook_t log_hook;
    void *log_ctx;
    esp_ui_step_hook_t step_hook;
    void *step_ctx;
} esp_ui_hooks_t;

static esp_ui_hooks_t g_ui_hooks;
static osMessageQueueId_t g_esp_ui_q = NULL;

void ESP_UI_SetHooks(esp_ui_log_hook_t log_hook, void *log_ctx,
                     esp_ui_step_hook_t step_hook, void *step_ctx)
{
    g_ui_hooks.log_hook = log_hook;
    g_ui_hooks.log_ctx = log_ctx;
    g_ui_hooks.step_hook = step_hook;
    g_ui_hooks.step_ctx = step_ctx;
}

/* 供 ESP_Log 调用：避免静态函数直接访问 hook 造成声明顺序问题 */
void ESP_UI_Internal_OnLog(const char *line)
{
    if (g_ui_hooks.log_hook && line)
    {
        g_ui_hooks.log_hook(line, g_ui_hooks.log_ctx);
    }
}

static void esp_ui_step_done(esp_ui_cmd_t step, bool ok)
{
    if (g_ui_hooks.step_hook)
    {
        g_ui_hooks.step_hook(step, ok, g_ui_hooks.step_ctx);
    }
}

void ESP_UI_TaskInit(void)
{
    if (g_esp_ui_q)
        return;
    g_esp_ui_q = osMessageQueueNew(8, sizeof(uint8_t), NULL);

}

bool ESP_UI_SendCmd(esp_ui_cmd_t cmd)
{
    if (!g_esp_ui_q)
        return false;
    uint8_t c = (uint8_t)cmd;
    return (osMessageQueuePut(g_esp_ui_q, &c, 0U, 0U) == osOK);
}

bool ESP_UI_IsReporting(void)
{
    return (g_report_enabled != 0U);
}

bool ESP_ServerReportFull(void)
{
    return (g_server_report_full != 0U);
}

bool ESP_UI_IsWiFiOk(void)
{
    return (g_ui_wifi_ok != 0U);
}

bool ESP_UI_IsTcpOk(void)
{
    return (g_ui_tcp_ok != 0U);
}

bool ESP_UI_IsRegOk(void)
{
    /* 注册 OK：以 g_ui_reg_ok 为准；同时 g_esp_ready 也代表“已注册+就绪可上报” */
    return (g_ui_reg_ok != 0U) || (g_esp_ready != 0U);
}

const char *ESP_UI_NodeId(void)
{
    const SystemConfig_t *cfg = ESP_Config_Get();
    if (cfg && cfg->node_id[0]) {
        return cfg->node_id;
    }
    return "--";
}

void ESP_UI_InvalidateReg(void)
{
    /* 仅清除“就绪可上报”标志，不做任何后台重连/硬复位 */
    g_esp_ready = 0;
    g_ui_reg_ok = 0;
    ESP_Log("[UI] Registration expired, please click REG again.\r\n");
}


static void ESP_UI_SyncLinkFlagsFromStatus(const esp32_spi_status_t *st)
{
    if (st == NULL) {
        return;
    }
    g_ui_wifi_ok = st->wifi_connected ? 1U : 0U;
    g_ui_tcp_ok = (st->cloud_connected || st->registered_with_cloud || st->reporting_enabled) ? 1U : 0U;
    g_ui_reg_ok = (st->registered_with_cloud || st->reporting_enabled) ? 1U : 0U;
    g_esp_ready = (st->registered_with_cloud || st->reporting_enabled) ? 1U : 0U;
    g_report_enabled = st->reporting_enabled ? 1U : 0U;
}

static void ESP_UI_ScheduleAutoRecover(const char *reason, uint8_t want_report)
{
    uint32_t now = HAL_GetTick();
    uint8_t should_log = (g_ui_auto_recover_pending == 0U);

    g_ui_auto_recover_pending = 1U;
    if (want_report != 0U) {
        g_ui_auto_recover_want_report = 1U;
    }
    if (g_ui_auto_recover_next_attempt_tick == 0U ||
        (int32_t)(g_ui_auto_recover_next_attempt_tick - now) > 1000) {
        g_ui_auto_recover_next_attempt_tick = now + 500U;
    }
    if (should_log) {
        ESP_Log("[ESP32SPI] scheduled auto recovery: %s (want_report=%u)\r\n",
                (reason != NULL) ? reason : "unspecified",
                (unsigned int)((want_report != 0U) ? 1U : g_ui_auto_recover_want_report));
    }
}

static bool ESP_UI_EnsureReportStartedEx(uint8_t mode, const char *reason_tag, uint8_t force_start)
{
    esp32_spi_status_t st;
    uint8_t target_mode = (mode != 0U) ? 1U : 0U;

    if (!g_esp_ready) {
        ESP_Log("[ESP32SPI] start report denied: link not ready.\r\n");
        return false;
    }

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    ESP_SPI_FullResetUploadRuntimeState();
#endif

    if (ESP32_SPI_QueryStatus(&st, 500U)) {
        ESP_UI_SyncLinkFlagsFromStatus(&st);
        if (st.reporting_enabled && st.report_mode == target_mode) {
            if (force_start == 0U) {
                g_report_enabled = 1U;
                (void)ESP_AutoReconnect_SetLastReporting(true);
                return true;
            }
            ESP_Log("[ESP32SPI] report already active on ESP32; force re-arm after recovery.\r\n");
        }
    }

    if (!ESP32_SPI_StartReport(target_mode, 3000U)) {
        if (ESP32_SPI_QueryStatus(&st, 1000U)) {
            ESP_UI_SyncLinkFlagsFromStatus(&st);
            if (st.reporting_enabled && st.report_mode == target_mode) {
                g_report_enabled = 1U;
                (void)ESP_AutoReconnect_SetLastReporting(true);
                return true;
            }
        }
        ESP_UI_SPI_LogStatus((reason_tag != NULL) ? reason_tag : "start report failed");
        return false;
    }

    g_report_enabled = 1U;
    (void)ESP_AutoReconnect_SetLastReporting(true);
    return true;
}

static bool ESP_UI_EnsureReportStarted(uint8_t mode, const char *reason_tag)
{
    return ESP_UI_EnsureReportStartedEx(mode, reason_tag, 0U);
}

