lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
static void ESP_UI_PollAutoRecover(void)
{
    uint32_t now = HAL_GetTick();
    bool auto_reconnect_en = false;
    bool last_reporting = false;
    uint8_t want_report = 0U;
    esp32_spi_status_t st;
    bool st_ok;
    bool need_recover = false;
    uint8_t report_force_start = 0U;
    uint8_t target_report_mode = ESP_ServerReportFull() ? 1U : 0U;

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    if (g_spi_full_continuous != 0U) {
        target_report_mode = 1U;
    }
#endif

    if ((int32_t)(now - g_ui_auto_recover_next_poll_tick) < 0) {
        return;
    }
    g_ui_auto_recover_next_poll_tick = now + ESP32_SPI_AUTO_RECOVER_POLL_MS;

    (void)ESP_AutoReconnect_Read(&auto_reconnect_en, &last_reporting);
    if (g_report_enabled != 0U || g_ui_auto_recover_want_report != 0U ||
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
        g_spi_full_continuous != 0U ||
#endif
        (auto_reconnect_en && last_reporting)) {
        want_report = 1U;
    }

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    if (ESP_SPI_FullControlBusy()) {
        return;
    }
#endif

    st_ok = ESP32_SPI_QueryStatus(&st, 500U);
    if (st_ok) {
        ESP_UI_SyncLinkFlagsFromStatus(&st);
        if (st.session_epoch != 0U) {
            if (g_ui_last_session_valid != 0U &&
                st.session_epoch != g_ui_last_session_epoch) {
                ESP_Log("[ESP32SPI] detected ESP32 session change old=%lu new=%lu\r\n",
                        (unsigned long)g_ui_last_session_epoch,
                        (unsigned long)st.session_epoch);
                need_recover = true;
            }
            g_ui_last_session_epoch = st.session_epoch;
            g_ui_last_session_valid = 1U;
        }
        if (want_report != 0U) {
            if (!st.wifi_connected ||
                !st.registered_with_cloud ||
                !st.reporting_enabled ||
                st.report_mode != target_report_mode) {
                need_recover = true;
            }
        }
    } else if (want_report != 0U) {
        need_recover = true;
        g_ui_wifi_ok = 0U;
        g_ui_tcp_ok = 0U;
        g_ui_reg_ok = 0U;
        g_esp_ready = 0U;
    }

    if (need_recover) {
        ESP_UI_ScheduleAutoRecover(st_ok ? "status degraded" : "status query failed",
                                   want_report);
    }

    if (g_ui_auto_recover_pending == 0U) {
        return;
    }
    if ((int32_t)(now - g_ui_auto_recover_next_attempt_tick) < 0) {
        return;
    }

    g_ui_auto_recover_next_attempt_tick = now + ESP32_SPI_AUTO_RECOVER_RETRY_MS;
    want_report = (g_ui_auto_recover_want_report != 0U || g_report_enabled != 0U ||
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
                   g_spi_full_continuous != 0U ||
#endif
                   (auto_reconnect_en && last_reporting)) ? 1U : 0U;

    ESP_Log("[ESP32SPI] auto recovery start want_report=%u auto=%u last=%u\r\n",
            (unsigned int)want_report,
            (unsigned int)(auto_reconnect_en ? 1U : 0U),
            (unsigned int)(last_reporting ? 1U : 0U));

    if (!ESP_Config_LoadRuntimeFromSD()) {
        ESP_Log("[ESP32SPI] auto recovery aborted: SD runtime config invalid.\r\n");
        g_ui_auto_recover_next_attempt_tick = now + ESP32_SPI_AUTO_RECOVER_FAIL_BACKOFF_MS;
        return;
    }
    target_report_mode = ESP_ServerReportFull() ? 1U : 0U;
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    if (g_spi_full_continuous != 0U) {
        target_report_mode = 1U;
        g_server_report_full = 1U;
    }
#endif

    if (!st_ok) {
        memset(&st, 0, sizeof(st));
    }
    if (!st_ok || !st.wifi_connected) {
        report_force_start = want_report;
        if (!ESP_UI_DoWiFi()) {
            ESP_Log("[ESP32SPI] auto recovery failed at WIFI step.\r\n");
            g_ui_auto_recover_next_attempt_tick = now + ESP32_SPI_AUTO_RECOVER_FAIL_BACKOFF_MS;
            return;
        }
        st_ok = ESP32_SPI_QueryStatus(&st, 1000U);
        if (st_ok) {
            ESP_UI_SyncLinkFlagsFromStatus(&st);
        }
    }
    if (!st_ok || (!st.cloud_connected && !st.registered_with_cloud && !st.reporting_enabled)) {
        if (!ESP_UI_DoTCP()) {
            ESP_Log("[ESP32SPI] auto recovery failed at TCP/cloud step.\r\n");
            g_ui_auto_recover_next_attempt_tick = now + ESP32_SPI_AUTO_RECOVER_FAIL_BACKOFF_MS;
            return;
        }
        st_ok = ESP32_SPI_QueryStatus(&st, 1000U);
        if (st_ok) {
            ESP_UI_SyncLinkFlagsFromStatus(&st);
        }
    }
    if (!st_ok || !st.registered_with_cloud) {
        if (!ESP_UI_DoRegister()) {
            ESP_Log("[ESP32SPI] auto recovery failed at REG step.\r\n");
            g_ui_auto_recover_next_attempt_tick = now + ESP32_SPI_AUTO_RECOVER_FAIL_BACKOFF_MS;
            return;
        }
        st_ok = ESP32_SPI_QueryStatus(&st, 1000U);
        if (st_ok) {
            ESP_UI_SyncLinkFlagsFromStatus(&st);
        }
    }
    if (want_report != 0U &&
        (report_force_start != 0U ||
         !st_ok ||
         !st.reporting_enabled ||
         st.report_mode != target_report_mode)) {
        if (target_report_mode != 0U) {
            g_server_report_full = 1U;
        }
        if (!ESP_UI_EnsureReportStartedEx(target_report_mode,
                                          "auto recovery start report failed",
                                          report_force_start)) {
            ESP_Log("[ESP32SPI] auto recovery failed at report start step.\r\n");
            g_ui_auto_recover_next_attempt_tick = now + ESP32_SPI_AUTO_RECOVER_FAIL_BACKOFF_MS;
            return;
        }
        st_ok = ESP32_SPI_QueryStatus(&st, 1000U);
        if (st_ok) {
            ESP_UI_SyncLinkFlagsFromStatus(&st);
        }
    }

    g_ui_auto_recover_pending = 0U;
    g_ui_auto_recover_want_report = 0U;
    if (st_ok && st.session_epoch != 0U) {
        g_ui_last_session_epoch = st.session_epoch;
        g_ui_last_session_valid = 1U;
    }
    ESP_Log("[ESP32SPI] auto recovery complete: wifi=%u cloud=%u reg=%u report=%u mode=%u\r\n",
            st_ok ? (unsigned int)st.wifi_connected : 0U,
            st_ok ? (unsigned int)st.cloud_connected : 0U,
            st_ok ? (unsigned int)st.registered_with_cloud : 0U,
            st_ok ? (unsigned int)st.reporting_enabled : 0U,
            st_ok ? (unsigned int)st.report_mode : 0U);
}

static bool ESP_UI_SPI_LoadAndApplyConfig(void)
{
    const SystemConfig_t *cfg;
    ESP_CommParams_t p;

    if (!ESP_Config_LoadRuntimeFromSD()) {
        ESP_Log("[ESP32SPI] SD runtime config invalid; abort apply.\r\n");
        return false;
    }

    cfg = ESP_Config_Get();
    ESP_CommParams_Get(&p);

